#include <iostream>
#include <fstream>
#include <sstream>

using namespace std;
string tab[4]; // кількість стовпчиків

//Вибірка одного рядка

//Отримання даних з рядка
void dataRow(string line, string *tab) {

	int i = 0;

	stringstream ssin(line);
	while (ssin.good() && i < 4) {
		ssin >> tab[i];
		++i;
	}
}



int main() {
	
	/*
	Предметна область - спеціалізований магазин із продажу аудіо-, відеотехніки і деталей до них. 
Розв'язувані задачі: облік товарів. Реалізувати наступні сервіси: 
Заповнення бази даних 
Перегляд даних про всі товари 
Доповнення бази даних товаром 
Видалення товару із бази даних 
Редагування запису про певний товар 
Упорядкування по полях: назва товару, ціна товару 
Пошук: наприклад, фірма ХХ і все, що з нею зв'язане; магнітофони УУ 
Вибірка: товари певного типу за ціною від X до Y 
Обчислення: середня ціна на товари певного типу (наприклад, телевізори) 
Корекція: видалення зведень про вказані товари; зміна ціни на товари вказаного типу (наприклад, телевізори фірми SONY на 5 %) 
Табличний звіт: інформація про телевізори (марка, ціна, назва), впорядкування по полю “назва” 
Додаткові вимоги: перевірка на введення ціни товару (повинна бути більше 0 грн.). 
Для обробки даних скористатися динамічним масивом покажчиків на структури відповідного типу.  
	*/

	const int len = 30, strings = 4;
	const char ch = '\n';
	char rows[len][strings];

	ifstream fs("db.txt", ios::in | ios::binary);

	if (!fs) return 1; //Если ошибка открытия файла, то завершаем программу

	for (int r = 0; r < strings; r++)
	{
		fs.getline(rows[r], len - 1, ch); //Считываем строки в массив
		cout << "String " << r + 1 << " = " << rows[r] << endl; //Выводи строку из массива
	}
	fs.close(); //Закрываем файл


	string line = "test one two three.";
	

	dataRow(line, tab);


	for (int i = 0; i < 4; i++) {
		cout << tab[i] << endl;
	}



	system("pause");
	return 0;
}